Update doc_uml.md
